___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

## MAY 02, 2020

# Introduction to Pandas

In this section of the course we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, you should go through the notebooks in this order:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

Pandas is an open source library build on the of the NumPy.
It allows for fast and data cleaning and preparing.
It excel in performance and productivity.
It also has built in visualization features.
It can work with data from wide variety of sources.

## How to install Pandas

go to the command line or the terminal

conda install pandas

pip install pandas

## Series

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

In [4]:
import numpy as np
import pandas as pd

In [7]:
lables = ['a','b','c']  #  is list
my_data = [10,20,30] #lits
arr=np.array(my_data) #array
d = {'a':10,'b':20,'c':30}#dictionary

In [8]:
lables #list

['a', 'b', 'c']

In [9]:
my_data #list

[10, 20, 30]

In [10]:
arr

array([10, 20, 30])

In [11]:
d

{'a': 10, 'b': 20, 'c': 30}

### Creating a Series

 Now lets create a series and how it will looks like

In [12]:
pd.Series(data = my_data) #focusing on the data and index only

0    10
1    20
2    30
dtype: int64

In [13]:
pd.Series(data = my_data, index = lables)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(my_data,lables)

a    10
b    20
c    30
dtype: int64

### Lets see couple of more ways to create a series

In [15]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [16]:
pd.Series(arr,lables)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(d)# d is the dictionary . here a, b and c are the keys of the dictionary

a    10
b    20
c    30
dtype: int64

## Data in a Series

A pandas Series can hold a variety of object types:

In [18]:
pd.Series(lables)#  here a,b,c are the strings.. so series can  hold any type of the data type

0    a
1    b
2    c
dtype: object

In [20]:
pd.Series(data =[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an IndexÂ¶

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [22]:
sr1 =pd.Series([1,2,3,4],['USA',"NEPAL",'Germany','Japan'])
sr1 # countries names are the index lables and the 1,2,3,4  are the data points
# dtype : int64 means the data are the integers

USA        1
NEPAL      2
Germany    3
Japan      4
dtype: int64

In [24]:
sr2 =pd.Series([1,2,5,4],['USA',"NEPAL",'Italy','Japan'])
sr2

USA      1
NEPAL    2
Italy    5
Japan    4
dtype: int64

In [25]:
sr1['USA']

1

In [27]:
sr3 = pd.Series(data=lables)
sr3

0    a
1    b
2    c
dtype: object

In [28]:
sr3[2]

'c'

Operations are then also done based off of index:

In [30]:
sr1 + sr2 # the integers are added Nepal 2 + = 4
#where it doesn't match the index it prints NAN 
#After addition it returns the float no as float is more precise

Germany    NaN
Italy      NaN
Japan      8.0
NEPAL      4.0
USA        2.0
dtype: float64

# Data Frames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [34]:
import numpy as np
import pandas as pd

In [35]:
from numpy.random import randn
np.random.seed(101)

### Morre detail about the DataFrame -----------> pd.DataFrame(press shift+Tab



Init signature: pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
Docstring:     
Two-dimensional size-mutable, potentially heterogeneous tabular data
structure with labeled axes (rows and columns). Arithmetic operations
align on both row and column labels. Can be thought of as a dict-like
container for Series objects. The primary pandas data structure.

Parameters
----------
data : numpy ndarray (structured or homogeneous), dict, or DataFrame
    Dict can contain Series, arrays, constants, or list-like objects

    

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided
columns : Index or array-like
    Column labels to use for resulting frame. Will default to
    RangeIndex (0, 1, 2, ..., n) if no column labels are provided
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer
copy : boolean, default False
    Copy data from inputs. Only affects DataFrame / 2d ndarray input

In [555]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df # different Series sharing a common index

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078
B -0.104981  0.549376 -0.203750  0.045195
C -2.023084 -0.102745 -0.850154 -0.642176
D -0.244018 -0.259631  0.957083  0.390422
E -0.158673 -0.930184 -2.120654  0.025956

Each  column represent a panda series that is for example W is a panda series

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [556]:
df['W']# is exactly is a Series

A    0.266287
B   -0.104981
C   -2.023084
D   -0.244018
E   -0.158673
Name: W, dtype: float64

In [557]:
type(df['W'])

pandas.core.series.Series

### can pass the list of the column names

In [558]:
df[['W','Z']]#make sure there are two [[]].AS the first one[] goes for index and the second[] is for list

          W         Z
A  0.266287  0.280078
B -0.104981  0.045195
C -2.023084 -0.642176
D -0.244018  0.390422
E -0.158673  0.025956

### SQL Syntax(Not recommended)

In [559]:
df.W

A    0.266287
B   -0.104981
C   -2.023084
D   -0.244018
E   -0.158673
Name: W, dtype: float64

### Creating a new column:

In [560]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.266287  0.172699 -0.118088  0.280078  0.148198
B -0.104981  0.549376 -0.203750  0.045195 -0.308731
C -2.023084 -0.102745 -0.850154 -0.642176 -2.873238
D -0.244018 -0.259631  0.957083  0.390422  0.713065
E -0.158673 -0.930184 -2.120654  0.025956 -2.279326

### Removing Column

In [561]:
df.drop('new',axis = 1)

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078
B -0.104981  0.549376 -0.203750  0.045195
C -2.023084 -0.102745 -0.850154 -0.642176
D -0.244018 -0.259631  0.957083  0.390422
E -0.158673 -0.930184 -2.120654  0.025956

In [562]:
df # new is still in the df

          W         X         Y         Z       new
A  0.266287  0.172699 -0.118088  0.280078  0.148198
B -0.104981  0.549376 -0.203750  0.045195 -0.308731
C -2.023084 -0.102745 -0.850154 -0.642176 -2.873238
D -0.244018 -0.259631  0.957083  0.390422  0.713065
E -0.158673 -0.930184 -2.120654  0.025956 -2.279326

To remove the column permanently we need to provide the inplace argument

In [563]:
df.drop('new',axis = 1,inplace = True)
df # the 'new' columln is removed permanently

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078
B -0.104981  0.549376 -0.203750  0.045195
C -2.023084 -0.102745 -0.850154 -0.642176
D -0.244018 -0.259631  0.957083  0.390422
E -0.158673 -0.930184 -2.120654  0.025956

### Can drop the rows in this way

In [564]:
df.drop('E') #or df.drop('E', axis = 0) works either way

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078
B -0.104981  0.549376 -0.203750  0.045195
C -2.023084 -0.102745 -0.850154 -0.642176
D -0.244018 -0.259631  0.957083  0.390422

In [565]:
df.drop('E', axis = 0)

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078
B -0.104981  0.549376 -0.203750  0.045195
C -2.023084 -0.102745 -0.850154 -0.642176
D -0.244018 -0.259631  0.957083  0.390422

In [566]:
df.shape

(5, 4)

In [567]:
df

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078
B -0.104981  0.549376 -0.203750  0.045195
C -2.023084 -0.102745 -0.850154 -0.642176
D -0.244018 -0.259631  0.957083  0.390422
E -0.158673 -0.930184 -2.120654  0.025956

## Selecting rows

### There are two ways of selecting rows : first method is the label based location

In [568]:
df.loc['A'] #label base location

W    0.266287
X    0.172699
Y   -0.118088
Z    0.280078
Name: A, dtype: float64

### Another way of selecting rows which is index based location

In [569]:
df.iloc[0] # note A has 0 index and C has index 2 and so on

W    0.266287
X    0.172699
Y   -0.118088
Z    0.280078
Name: A, dtype: float64

### NOw selecting the subset of rows and columns

In [570]:
df.loc['B','Y']

-0.20375023974386444

In [571]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.266287 -0.118088
B -0.104981 -0.203750

In [572]:
df.loc[['A','B'],['W','X','Z']]

          W         X         Z
A  0.266287  0.172699  0.280078
B -0.104981  0.549376  0.045195

## DataFame Part 2

### Conditional Selection

#### An important feature of pandas is conditional selection using bracket notation, very similar to numpy

In [573]:
df

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078
B -0.104981  0.549376 -0.203750  0.045195
C -2.023084 -0.102745 -0.850154 -0.642176
D -0.244018 -0.259631  0.957083  0.390422
E -0.158673 -0.930184 -2.120654  0.025956

In [574]:
df>0

       W      X      Y      Z
A   True   True  False   True
B  False   True  False   True
C  False  False  False  False
D  False  False   True   True
E  False  False  False   True

The more detail about the process

In [575]:
booldf = df>0
booldf

       W      X      Y      Z
A   True   True  False   True
B  False   True  False   True
C  False  False  False  False
D  False  False   True   True
E  False  False  False   True

In [576]:
df[booldf]

          W         X         Y         Z
A  0.266287  0.172699       NaN  0.280078
B       NaN  0.549376       NaN  0.045195
C       NaN       NaN       NaN       NaN
D       NaN       NaN  0.957083  0.390422
E       NaN       NaN       NaN  0.025956

Which is similar to the folloowing syntax

In [577]:
df[df>0]

          W         X         Y         Z
A  0.266287  0.172699       NaN  0.280078
B       NaN  0.549376       NaN  0.045195
C       NaN       NaN       NaN       NaN
D       NaN       NaN  0.957083  0.390422
E       NaN       NaN       NaN  0.025956

This method is not that common that is in stead of passing the whole dataframe we will pas the  row or a column vallue

In [578]:
df

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078
B -0.104981  0.549376 -0.203750  0.045195
C -2.023084 -0.102745 -0.850154 -0.642176
D -0.244018 -0.259631  0.957083  0.390422
E -0.158673 -0.930184 -2.120654  0.025956

In [579]:
df['W']>0

A     True
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [580]:
df['W']

A    0.266287
B   -0.104981
C   -2.023084
D   -0.244018
E   -0.158673
Name: W, dtype: float64

In [581]:
df[df['W']>0] # only the following row has all positive values

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078

Now I want to grab only those values where z<0

In [582]:
df[df["Z"]<0]#note will return the only those rows or that row where z is <0

          W         X         Y         Z
C -2.023084 -0.102745 -0.850154 -0.642176

In [583]:
df[df['Y']>0]

          W         X         Y         Z
D -0.244018 -0.259631  0.957083  0.390422

In [584]:
resultdf = df[df['Y']>0]
resultdf

          W         X         Y         Z
D -0.244018 -0.259631  0.957083  0.390422

In [585]:
resultdf['X']

D   -0.259631
Name: X, dtype: float64

The above two steps can do in one step

In [586]:
df[df['Y']>0]["X"] #got the same result as above

D   -0.259631
Name: X, dtype: float64

Actually we can pass multiple list in stead of  one column: see the following syntax

In [588]:
df[df['Y']>0][['W','X']]

          W         X
D -0.244018 -0.259631

In [589]:
df[df['Y']>0][['X','W']]

          X         W
D -0.259631 -0.244018

In [122]:
df[df['Y']>0][['X','X']]

          X         X
A -0.855196 -0.855196
B -0.568581 -0.568581
C -0.391157 -0.391157

#### The above syntax that is df[df['Y']>0][['X','X']] is actually the folowing set of lines

In [590]:
boolser=df['Y']>0
result=df[boolser]
my_columns=['W','X']
result[my_columns] #wlll get exactly what we get before

          W         X
D -0.244018 -0.259631

### Concept of using the multiple conditions

In [ ]:
# df[(df['W']>0) and(df['X']>0)] This is a wrong statement because of the following reason
# df['W']>0   returns a True (say) and
# df['X']>0   returns again True
# Now the and operator is looks like the following
# True and True so the program confuses and then displays an error

Therfore the correct ststement is the following

In [592]:
df[(df['W']>0) & (df['Y']>0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

when you do the OR operation just replace the & by the |  pipe operator

In [129]:
df[(df['W']>0) | (df['Y']>1)] #note do not use the 'or' operator

          W         X         Y         Z
A  0.221491 -0.855196  1.541990  0.666319
B -0.538235 -0.568581  1.407338  0.641806
C -0.905100 -0.391157  1.028293 -1.972605

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [593]:
df #  original data frame

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078
B -0.104981  0.549376 -0.203750  0.045195
C -2.023084 -0.102745 -0.850154 -0.642176
D -0.244018 -0.259631  0.957083  0.390422
E -0.158673 -0.930184 -2.120654  0.025956

In [594]:
df.reset_index() # the index will reset to a column
# index reset to a column and you will get the acual index to be numerical

  index         W         X         Y         Z
0     A  0.266287  0.172699 -0.118088  0.280078
1     B -0.104981  0.549376 -0.203750  0.045195
2     C -2.023084 -0.102745 -0.850154 -0.642176
3     D -0.244018 -0.259631  0.957083  0.390422
4     E -0.158673 -0.930184 -2.120654  0.025956

But when we recall back the original dataframe we will have the following df with out the actual index

In [595]:
df #The firsst column of 0,1,2.. is not there

          W         X         Y         Z
A  0.266287  0.172699 -0.118088  0.280078
B -0.104981  0.549376 -0.203750  0.045195
C -2.023084 -0.102745 -0.850154 -0.642176
D -0.244018 -0.259631  0.957083  0.390422
E -0.158673 -0.930184 -2.120654  0.025956

#### Again to make it permanent use the syntax: df.reset_index(inplace = True)

one more new index setting example

In [596]:
new_ind = 'CA NY WY OR CO'.split()
new_ind# .split is the way of splitting the space

['CA', 'NY', 'WY', 'OR', 'CO']

In [597]:
df['states']=new_ind

In [598]:
df

          W         X         Y         Z states
A  0.266287  0.172699 -0.118088  0.280078     CA
B -0.104981  0.549376 -0.203750  0.045195     NY
C -2.023084 -0.102745 -0.850154 -0.642176     WY
D -0.244018 -0.259631  0.957083  0.390422     OR
E -0.158673 -0.930184 -2.120654  0.025956     CO

### how to make an existing column an index?

In [599]:
df.set_index('states')

               W         X         Y         Z
states
CA      0.266287  0.172699 -0.118088  0.280078
NY     -0.104981  0.549376 -0.203750  0.045195
WY     -2.023084 -0.102745 -0.850154 -0.642176
OR     -0.244018 -0.259631  0.957083  0.390422
CO     -0.158673 -0.930184 -2.120654  0.025956

In [601]:
df # original is not changed unless we do inplace = True

          W         X         Y         Z states
A  0.266287  0.172699 -0.118088  0.280078     CA
B -0.104981  0.549376 -0.203750  0.045195     NY
C -2.023084 -0.102745 -0.850154 -0.642176     WY
D -0.244018 -0.259631  0.957083  0.390422     OR
E -0.158673 -0.930184 -2.120654  0.025956     CO

So to make the 'states' as a permanent index write the following syntax

In [602]:
df.set_index('states',inplace=True)
df

               W         X         Y         Z
states
CA      0.266287  0.172699 -0.118088  0.280078
NY     -0.104981  0.549376 -0.203750  0.045195
WY     -2.023084 -0.102745 -0.850154 -0.642176
OR     -0.244018 -0.259631  0.957083  0.390422
CO     -0.158673 -0.930184 -2.120654  0.025956

In [603]:
df

               W         X         Y         Z
states
CA      0.266287  0.172699 -0.118088  0.280078
NY     -0.104981  0.549376 -0.203750  0.045195
WY     -2.023084 -0.102745 -0.850154 -0.642176
OR     -0.244018 -0.259631  0.957083  0.390422
CO     -0.158673 -0.930184 -2.120654  0.025956

In [604]:
df  #The state is a permanent index now as we did the inplace = True

               W         X         Y         Z
states
CA      0.266287  0.172699 -0.118088  0.280078
NY     -0.104981  0.549376 -0.203750  0.045195
WY     -2.023084 -0.102745 -0.850154 -0.642176
OR     -0.244018 -0.259631  0.957083  0.390422
CO     -0.158673 -0.930184 -2.120654  0.025956

# Panda DataFrame Part3

# Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

lets creaete a quick example of the multi index data look s like

In [172]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index= list(zip(outside,inside))
higher_index=pd.MultiIndex.from_tuples(hier_index)

In [173]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [174]:
inside

[1, 2, 3, 1, 2, 3]

In [175]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [176]:
higher_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [445]:
df4= pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])
df4 # the data frame has the two level of index

                A         B
(G1, 1) -0.447898  0.266207
(G1, 2)  0.412580  0.988773
(G1, 3)  0.513833 -0.928205
(G2, 1)  0.846904 -0.298436
(G2, 2)  0.029141  0.889031
(G2, 3) -1.839261  0.863596


### How to call the data from the multi level index?

In [446]:
df4.loc['G1']# do not understand the error
#something wrong

KeyError: 'the label [G1] is not in the [index]'

In [447]:
df4.loc['G1'].loc[1] #something wrong again

KeyError: 'the label [G1] is not in the [index]'

let us give the index some name

In [448]:
df4.index.name='Group'
df4

                A         B
Group
(G1, 1) -0.447898  0.266207
(G1, 2)  0.412580  0.988773
(G1, 3)  0.513833 -0.928205
(G2, 1)  0.846904 -0.298436
(G2, 2)  0.029141  0.889031
(G2, 3) -1.839261  0.863596

In [ ]:
df4.loc

## Crosssection

In [190]:
df4.xs('G1') # some thing wrong

KeyError: 'G1'

## Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

If you have missing points, pandas will automatically fill in that missing point

In [192]:
import numpy as np
import pandas as pd

In [449]:
d ={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]} # np.nan to sig vluenify the missing ordinal
df5 = pd.DataFrame(d)
df5

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

note in the above data   frame roe 0   has no missing values and column c has no missing values

In [ ]:
Now lets eplore the dropna() methosd

In [195]:
df.dropna() # any row has missing values will be dropped

     A    B  C
0  1.0  5.0  1

We can do the same operation in the column as well

In [450]:
df5.dropna(axis =1) # meaning drop the column which has the NaN value
# or will drop the colum  with the null value

   C
0  1
1  2
2  3

Signature: df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
Docstring:
Remove missing values.

See the :ref:`User Guide <missing_data>` for more on which values are
considered missing, and how to work with missing data.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Determine if rows or columns which contain missing values are
    removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

    .. deprecated:: 0.23.0: Pass tuple or list to drop on multiple
    axes.
how : {'any', 'all'}, default 'any'
    Determine if row or column is removed from DataFrame, when we have
    at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.
thresh : int, optional
    Require that many non-NA values.
subset : array-like, optional
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include.
inplace : bool, default False
    If True, do operation inplace and return None.

### Now I am going to  give one threshold = int argument

In [451]:
df5.dropna( thresh=2)# means non nan values reqire 2 or more .
# for example index 1 has two halues 2.0 & 2
#index 2 has only one non Nan value which is 3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [452]:
df5.dropna( thresh=1)#because all of them has at least non -NaN value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### How to replace the NaN values?

One method is the fillna() method

In [453]:
df5.fillna(value="FILL_VALUE") # we put a easy string

            A           B  C
0           1           5  1
1           2  FILL_VALUE  2
2  FILL_VALUE  FILL_VALUE  3

Most of the time we fill the mean of the column

In [454]:
df5['A'] # has one missing value. I will replace the value by the mean of the column

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [456]:
df5['A'].fillna(value=df['A'].mean())

KeyError: 'A'

# GroupbyÂ¶

The groupby method allows you to group rows of data together and call aggregate functions

In [606]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [607]:
df6 = pd.DataFrame(data)
df6

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

NOw what we can do is use that groupby method to group roews rows together based off of a column name for 
for instance lets go ahead and group by the company

In [608]:
df6.groupby('Company')# I will get a groupby object just to point where it stores at memory

In [609]:
by_comp = df6.groupby('Company')

In [610]:
by_comp

In [611]:
by_comp.mean()# pandas automTIClly  ignore the non numeric column
# for example person column doesnot have the numerical values and will be ignored

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [612]:
by_comp.sum()#

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [613]:
by_comp.std() #standard deviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [614]:
by_comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

### can do all of above in one line

In [615]:
df6.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [617]:
df6.groupby('Company').count() # counts the no of instances

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [619]:
df6.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [620]:
df6.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [621]:
df6.groupby('Company').describe()# will give alot of the useful information

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [622]:
df6.groupby('Company').describe().transpose()#will make the style in vertical direction

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [223]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. In this lecture we will discuss these 3 methods with examples.

### Example DataFrames

In [226]:
import pandas as pd

In [228]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','c1','C2','C3'],
                    'D':['D0','D1','D2','D3']}, 
                   index =[0,1,2,3])

In [230]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A3'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','c5','C6','C7'],
                    'D':['D4','D5','D6','D7']}, 
                   index =[4,5,6,7])

In [239]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','c9','C10','C11'],
                    'D':['D8','D9','D10','D11']}, 
                   index =[8,9,10,11])

In [229]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  c1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [231]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  c5  D5
6  A6  B6  C6  D6
7  A3  B7  C7  D7

In [240]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   c9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

### syntax:    pd.concat([list of data frames need to be concaneted])

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [241]:
pd.concat([df1,df2,df3]) # the concatenate is along row by default

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   c1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   c5   D5
6    A6   B6   C6   D6
7    A3   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   c9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Lets see howit looks like if we concatenate  by column wise make sure it will need an argument: axis = 1

In [242]:
pd.concat([df1,df2,df3],axis=1)
# note that we will have a bunch of missing values because we don't have data for those indicies

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   c1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   c5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A3   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   c9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## More Examples of DataFrames

In [490]:
left = pd.DataFrame({'key':['k0','k1','k2','k3'],
                    'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['k0','k1','k2','k3'],
                    'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})

In [491]:
left

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [492]:
right

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [493]:
pd.concat([left,right])

/home/bishnu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C    D key
0   A0   B0  NaN  NaN  k0
1   A1   B1  NaN  NaN  k1
2   A2   B2  NaN  NaN  k2
3   A3   B3  NaN  NaN  k3
0  NaN  NaN   C0   D0  k0
1  NaN  NaN   C1   D1  k1
2  NaN  NaN   C2   D2  k2
3  NaN  NaN   C3   D3  k3

In [494]:
pd.concat([left,right],sort=True)

     A    B    C    D key
0   A0   B0  NaN  NaN  k0
1   A1   B1  NaN  NaN  k1
2   A2   B2  NaN  NaN  k2
3   A3   B3  NaN  NaN  k3
0  NaN  NaN   C0   D0  k0
1  NaN  NaN   C1   D1  k1
2  NaN  NaN   C2   D2  k2
3  NaN  NaN   C3   D3  k3

## Merge

### Lets do merging on the above left and right dataframe

## syntax for merge: 
pd.merge(1st data frame,2nd data frame)

The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [270]:
# pd.merge(left,right)

If not familer with the SQL table forgot about the how and on ....

In [283]:
pd.merge(left,right,how='inner',on='key')

# Note: According to the lecture it should merge across the 'key, column that is 'key' column is common 
#on both data frames and shod merge accordingly but it doesn't work that way
# #     A 	B 	key 	C 	D
# 0 	A0 	B0 	K0 	 C0 	D0
# 1 	A1 	B1 	K1 	 C1 	D1
# 2 	A2 	B2 	K2 	 C2 	D2
# 3 	A3 	B3 	K3 	 C3 	D3

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Lets see the  more complicated example:

In [284]:
LEFT= pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
RIGHT = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [285]:
LEFT

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [286]:
RIGHT

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [287]:
pd.merge(LEFT,RIGHT,on=['key1','key2']) # should merge on key1 and k2 but sthing wrong
#I really do not understand the mergong process

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [289]:
pd.merge(LEFT, RIGHT, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [290]:
pd.merge(LEFT, RIGHT, how='right', on=['key1', 'key2'])# do not understand the concept

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [291]:
pd.merge(LEFT, RIGHT, how='left', on=['key1', 'key2'])#try again

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

## syntax for join:

#### left dataframe.join(right data frame )

In [485]:
left_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right_1 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [486]:
left_1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [487]:
right_1

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [488]:
left_1.join(right_1)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [489]:
left_1.join(right_1,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

In [462]:
import pandas as pd
df_a=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyzlm']})
df_a

   col1  col2   col3
0     1   444    abc
1     2   555    def
2     3   666    ghi
3     4   444  xyzlm

In [463]:
df_a.head()# do not understand

   col1  col2   col3
0     1   444    abc
1     2   555    def
2     3   666    ghi
3     4   444  xyzlm

In [464]:
df_a['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

### There are three unique methods

In [465]:
df_a['col2'].unique() # the repeated item ignored

array([444, 555, 666])

In [406]:
df['col2'].nunique()#  number of the unque values

3

In [466]:
df_a['col2'].value_counts()#table of the unique values and how many times they shows up

444    2
555    1
666    1
Name: col2, dtype: int64

## Selecting DataÂ¶

In [467]:
#Select from DataFrame using criteria from multiple columns
newdf = df_a[(df_a['col1']>2) & (df_a['col2']==444)]
newdf

   col1  col2   col3
3     4   444  xyzlm

## Applying Functions

In [409]:
def times2(x):
    return x*2

In [468]:
df_a

   col1  col2   col3
0     1   444    abc
1     2   555    def
2     3   666    ghi
3     4   444  xyzlm

In [469]:
df_a['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [470]:
df_a['col1'].apply(times2)#

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [471]:
df_a['col2'].apply(lambda i:i*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [472]:
df_a['col3'].apply(len) # returns the length of each of the string in the column3

0    3
1    3
2    3
3    5
Name: col3, dtype: int64

In [473]:
df_a['col1'].sum()# returns the sum of all of the items in the col1

10

## permanently remove a column

In [475]:
df_a1=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyzlm']})
df_a1

   col1  col2   col3
0     1   444    abc
1     2   555    def
2     3   666    ghi
3     4   444  xyzlm

In [476]:
df_a1.drop('col1',axis=1)# pass the column you want to remove

   col2   col3
0   444    abc
1   555    def
2   666    ghi
3   444  xyzlm

In [477]:
df_a1 # not permanent as have to do inplace =True for the permanent deletion

   col1  col2   col3
0     1   444    abc
1     2   555    def
2     3   666    ghi
3     4   444  xyzlm

In [478]:
df_a2=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyzlm']})
df_a2

   col1  col2   col3
0     1   444    abc
1     2   555    def
2     3   666    ghi
3     4   444  xyzlm

#### permanent delete of a column

In [479]:
del df_a2['col1']
df_a2

   col2   col3
0   444    abc
1   555    def
2   666    ghi
3   444  xyzlm

### ** Get column and index names: **

In [480]:
df_a

   col1  col2   col3
0     1   444    abc
1     2   555    def
2     3   666    ghi
3     4   444  xyzlm

In [481]:
df_a.columns# returns the list of the column name

Index(['col1', 'col2', 'col3'], dtype='object')

In [482]:
df_a.index # start , stop and the step size of  the indewx

RangeIndex(start=0, stop=4, step=1)

### ** Sorting and Ordering a DataFrame:**

In [483]:
df_a.sort_values(by='col2')# not understand very well but data is changed as the index are 0,3,1,2

   col1  col2   col3
0     1   444    abc
3     4   444  xyzlm
1     2   555    def
2     3   666    ghi

****How to find the null values in the data frame

In [484]:
df_a.isnull() # will return in the form of the boolean

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### df.dropna()    --------->Drops rows with NaN Values

In [459]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df_3 = pd.DataFrame(data)

In [460]:
df_3 # have some represting values

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

can use the pivot table

create a multi index out of the above table

In [461]:
df_3.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data Input and Output

#### pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [442]:
import numpy as np
import pandas as pd

### In order to know what file pandas can read do;----> pd.read_      .....pres shift+Tab

In [625]:
df_b = pd.read_csv('example') #examle is a csv file
df_b #  will return a csv file in the form of a data frame

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## csv output

In order to write on a csv files you need a dataframe

In [628]:
df10 = pd.read_csv('example') #examle is a csv file
df10 #  will return a csv

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [629]:
df10.to_csv('MY_output',index=False)# we don't want to save the indexa as column

In [630]:
pd.read_csv('MY_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

what if we  do not do index = False in the above example

In [634]:
df10.to_csv('MY_output_1')
pd.read_csv('MY_output_1') # displays extra index unnamed which we do not want

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

### Reading the Excel Files

Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash

In [636]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

writing a data frame to an excel is simple process

In [639]:
df11 = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')
df11

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [643]:
df11.to_excel('Excel_output.xlsx',sheet_name='newsheet')

In [644]:
pd.read_excel('Excel_output.xlsx',sheet_name='newsheet')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## Reading the html files

ou may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

conda install lxml
conda install html5lib
conda install BeautifulSoup4

Then restart Jupyter Notebook. (or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

## HTML InputÂ¶

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [645]:
data_1 = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [647]:
type(data_1)

list

In [646]:
data_1[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
5,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
6,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017"
7,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017"
8,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017"
9,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017"
10,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017"
11,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017"
12,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017"
13,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017"
14,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016"
15,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016"
16,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016"
17,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016"
18,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016"
19,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015"
20,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015"
21,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015"
22,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015"
23,Doral Bank En EspaÃ±ol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015"
24,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015"
25,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015"
26,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015"
27,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014"
28,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014"
29,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014"
...,...,...,...,...,...,...
531,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008"
532,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008"
533,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008"
534,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007"
535,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007"
536,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007"
537,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004"
538,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004"
539,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004"
540,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004"
541,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003"
542,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003"
543,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003"
544,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002"
545,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002"
546,AmTrade International Bank En EspaÃ±ol,Atlanta,GA,33784,No Acquirer,"September 30, 2002"
547,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002"
548,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002"
549,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002"
550,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002"
551,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002"
552,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002"
553,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002"
554,"Hamilton Bank, NA En EspaÃ±ol",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002"
555,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001"
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [648]:
data_1[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

## SQL (Optional)


    Note: If you are completely unfamiliar with SQL you can check out my other course: "Complete SQL Bootcamp" to learn SQL.

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Pythonâs standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.

If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

    read_sql_table(table_name, con[, schema, ...])
        Read SQL database table into a DataFrame.
    read_sql_query(sql, con[, index_col, ...])
        Read SQL query into a DataFrame.
    read_sql(sql, con[, index_col, ...])
        Read SQL query or database table into a DataFrame.
    DataFrame.to_sql(name, con[, flavor, ...])
        Write records stored in a DataFrame to a SQL database

In [ ]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine('sqlite:///:memory:')

In [ ]:
df.to_sql('data', engine)

In [ ]:
sql_df = pd.read_sql('data',con=engine)

In [ ]:
sql_df

## SF Salaries Exercise

Welcome to a quick exercise for you to practice your pandas skills! We will be using the SF Salaries Dataset from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

#### * Import pandas as pd.**

In [6]:
import pandas as pd

#### ** Read Salaries.csv as a dataframe called sal.**

In [7]:
pd.read_csv('Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601.00,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.00,51322.50,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.00,0.00,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN
10,11,ARTHUR KENNEY,"ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",194999.39,71344.88,33149.90,NaN,299494.17,299494.17,2011,NaN,San Francisco,NaN
11,12,PATRICIA JACKSON,CAPTAIN III (POLICE DEPARTMENT),99722.00,87082.62,110804.30,NaN,297608.92,297608.92,2011,NaN,San Francisco,NaN
12,13,EDWARD HARRINGTON,EXECUTIVE CONTRACT EMPLOYEE,294580.02,0.00,0.00,NaN,294580.02,294580.02,2011,NaN,San Francisco,NaN
13,14,JOHN MARTIN,DEPARTMENT HEAD V,271329.03,0.00,21342.59,NaN,292671.62,292671.62,2011,NaN,San Francisco,NaN
14,15,DAVID FRANKLIN,"BATTALION CHIEF, (FIRE DEPARTMENT)",174872.64,74050.30,37424.11,NaN,286347.05,286347.05,2011,NaN,San Francisco,NaN
15,16,RICHARD CORRIEA,"COMMANDER III, (POLICE DEPARTMENT)",198778.01,73478.20,13957.65,NaN,286213.86,286213.86,2011,NaN,San Francisco,NaN
16,17,AMY HART,DEPARTMENT HEAD V,268604.57,0.00,16115.86,NaN,284720.43,284720.43,2011,NaN,San Francisco,NaN
17,18,SEBASTIAN WONG,"CAPTAIN, EMERGENCYCY MEDICAL SERVICES",140546.87,119397.26,18625.08,NaN,278569.21,278569.21,2011,NaN,San Francisco,NaN
18,19,MARTY ROSS,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.63,69626.12,38115.47,NaN,276434.22,276434.22,2011,NaN,San Francisco,NaN
19,20,ELLEN MOFFATT,ASSISTANT MEDICAL EXAMINER,257510.59,880.16,16159.50,NaN,274550.25,274550.25,2011,NaN,San Francisco,NaN
20,21,VENUS AZAR,ASSISTANT MEDICAL EXAMINER,257510.48,0.00,16679.79,NaN,274190.27,274190.27,2011,NaN,San Francisco,NaN
21,22,JUDY MELINEK,ASSISTANT MEDICAL EXAMINER,257510.44,377.21,15883.56,NaN,273771.21,273771.21,2011,NaN,San Francisco,NaN
22,23,GEORGE GARCIA,"CAPTAIN, FIRE SUPPRESSION",140546.88,93200.58,39955.25,NaN,273702.71,273702.71,2011,NaN,San Francisco,NaN
23,24,VICTOR WYRSCH,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.63,77896.14,24083.86,NaN,270672.63,270672.63,2011,NaN,San Francisco,NaN
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN
25,26,GREGORY SUHR,CHIEF OF POLICE,256470.41,0.00,11522.18,NaN,267992.59,267992.59,2011,NaN,San Francisco,NaN
26,27,JOHN HANLEY,"CAPTAIN, FIRE SUPPRESSION",92080.80,40008.00,133695.76,NaN,265784.56,265784.56,2011,NaN,San Francisco,NaN
27,28,RAYMOND GUZMAN,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.59,80706.88,16063.99,NaN,265463.46,265463.46,2011,NaN,San Francisco,NaN
28,29,DENISE SCHMITT,DEPUTY CHIEF III (POLICE DEPARTMENT),261717.60,0.00,2357.00,NaN,264074.60,264074.60,2011,NaN,San Francisco,NaN
29,30,MONICA FIELDS,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",246225.60,0.00,15140.54,NaN,261366.14,261366.14,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148624,148625,Lorraine Rosenthal,Senior Clerk,0.00,0.00,12.89,0.00,12.89,12.89,2014,NaN,San Francisco,NaN
148625,148626,Renato C Gurion,Registered Nurse,0.00,0.00,6.00,1.24,6.00,7.24,2014,NaN,San Francisco,NaN
148626,148627,Paulet Gaines,Account Clerk,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148627,148628,Brett A Lundberg,General Laborer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148628,148629,Mark W Mcclure,General Laborer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148629,148630,Elizabeth Iniguez,Transcriber Typist,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148630,148631,Randy J Keys,Carpenter,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148631,148632,Andre M Johnson,Communications Dispatcher 1,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148632,148633,Sharon D Owens-Webster,Protective Services Worker,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148633,148634,Edward Ferdinand,General Laborer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148634,148635,David M Turner,Transit Car Cleaner,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148635,148636,James S Kibblewhite,General Laborer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148636,148637,Andrew J Enzi,Arborist Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148637,148638,Kadeshra D Green,Transit Fare Inspector,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148638,148639,Lennard B Hutchinson,Electrician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148639,148640,Richard A Talbert,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148640,148641,Charlene D Mccully,Parking Control Officer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148641,148642,Raphael Marquis Goins,Museum Guard,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148642,148643,Dominic C Marquez,Sign Worker,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148643,148644,Kim Brewer,Parking Control Officer,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148646,148647,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148647,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148648,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,NaN

#### ** Check the head of the DataFrame. **

In [8]:
df_e = pd.read_csv('Salaries.csv')
df_e.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

#### ** Use the .info() method to find out how many entries there are.**

In [6]:
df_e.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

What is the average BasePay ?

In [7]:
df_e['BasePay'].mean()

66325.44884050643

#### ** What is the highest amount of OvertimePay in the dataset ? **

In [8]:
df_e['OvertimePay'].max()

245131.88

##### ** What is the job title of JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [9]:
df_e[df_e['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

#### ** How much does JOSEPH DRISCOLL make (including benefits)? **

In [10]:
df_e[df_e['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

#### ** What is the name of highest paid person (including benefits)?**

In [11]:
df_e[df_e['TotalPayBenefits']== df_e['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

#### Another way to approach the problem

In [13]:
df_e[df_e['TotalPayBenefits']== df_e['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

#### ** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [12]:
df_e[df_e['TotalPayBenefits']== df_e['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

### Another advance method

In [14]:
df_e.iloc[df_e['TotalPayBenefits'].argmin()]

/home/bishnu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: 'argmin' is deprecated, use 'idxmin' instead. The behavior of 'argmin'
will be corrected to return the positional minimum in the future.
Use 'series.values.argmin' to get the position of the minimum now.
  """Entry point for launching an IPython kernel.

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                      0
OvertimePay                                  0
OtherPay                               -618.13
Benefits                                     0
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                     NaN
title_len                                   26
Name: 148653, dtype: object

#### ** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [13]:
df_e.groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

#### ** How many unique job titles are there? **

In [14]:
df_e['JobTitle'].nunique()

2159

#### ** What are the top 5 most common jobs? **

In [15]:
df_e['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

#### ** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [42]:
sum(df_e[df_e['Year']==2013]['JobTitle'].value_counts()==1)

202

#### ** How many people have the word Chief in their job title? (This is pretty tricky) **

In [15]:
def chief_string(title):
    if 'chief' in title.lower().split():
        return True
    else:
        return False

In [16]:
sum(df_e['JobTitle'].apply(lambda x: chief_string(x)))

477

#### ** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [10]:
df_e['title_len'] = df_e['JobTitle'].apply(len)# do not understand

In [11]:
df_e[['title_len','TotalPayBenefits']].corr() #

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Ecommerce Purchases Exercise

In this Exercise you will be given some Fake Data about some purchases done through Amazon! Just go ahead and follow the directions and try your best to answer the questions and complete the tasks. Feel free to reference the solutions. Most of the tasks can be solved in different ways. For the most part, the questions get progressively harder.

Please excuse anything that doesn't make "Real-World" sense in the dataframe, all the data is fake and made-up.

Also note that all of these questions can be answered with one line of code.

** Import pandas and read in the Ecommerce Purchases csv file and set it to a DataFrame called ecom. **

#### ** Import pandas and read in the Ecommerce Purchases csv file and set it to a DataFrame called ecom. **

In [22]:
import pandas as pd

In [127]:
df_z = pd.read_csv('Ecommerce Purchases')# is csv file

#### Check the head of the DataFrame.

In [128]:
df_z.head() # will print th head of that data frame

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

#### ** How many rows and columns are there? **

There are several ways to solve this  problem

In [147]:
len(df_z.columns)

14

In [33]:
len(df_z.index) # can give the no of rows

10000

In [36]:
df_z.shape # gives the total rows and that of the column

(10000, 14)

In [38]:
df_z.info() # gives the information about the rows and the columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
Address             10000 non-null object
Lot                 10000 non-null object
AM or PM            10000 non-null object
Browser Info        10000 non-null object
Company             10000 non-null object
Credit Card         10000 non-null int64
CC Exp Date         10000 non-null object
CC Security Code    10000 non-null int64
CC Provider         10000 non-null object
Email               10000 non-null object
Job                 10000 non-null object
IP Address          10000 non-null object
Language            10000 non-null object
Purchase Price      10000 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

### ** What is the average Purchase Price? **

In [42]:
df_z['Purchase Price'].mean()

50.34730200000025

#### ** What were the highest and lowest purchase prices? **

In [43]:
df_z['Purchase Price'].max()

99.99

In [44]:
df_z['Purchase Price'].min()

0.0

#### ** How many people have English 'en' as their Language of choice on the website? **

In [54]:
sum(df_z['Language']=='en')  # not a good method

1098

In [132]:
df_z[df_z['Language']=='en'].count()

Address             1098
Lot                 1098
AM or PM            1098
Browser Info        1098
Company             1098
Credit Card         1098
CC Exp Date         1098
CC Security Code    1098
CC Provider         1098
Email               1098
Job                 1098
IP Address          1098
Language            1098
Purchase Price      1098
dtype: int64

#### ** How many people have the job title of "Lawyer" ? **

There are several ways to solve this problem

In [55]:
def Lawyer_st(title):
    if 'Lawyer' in title:
        return True
    else:
        return False

In [63]:
sum(df_z['Job'].apply(lambda x: Lawyer_st(x))) # check again

30

In [133]:
df_z[df_z['Job'].apply(lambda x: Lawyer_st(x))].count()

Address             30
Lot                 30
AM or PM            30
Browser Info        30
Company             30
Credit Card         30
CC Exp Date         30
CC Security Code    30
CC Provider         30
Email               30
Job                 30
IP Address          30
Language            30
Purchase Price      30
dtype: int64

In [134]:
df_z[df_z['Job'].apply(lambda x: Lawyer_st(x))].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 470 to 9979
Data columns (total 14 columns):
Address             30 non-null object
Lot                 30 non-null object
AM or PM            30 non-null object
Browser Info        30 non-null object
Company             30 non-null object
Credit Card         30 non-null int64
CC Exp Date         30 non-null object
CC Security Code    30 non-null int64
CC Provider         30 non-null object
Email               30 non-null object
Job                 30 non-null object
IP Address          30 non-null object
Language            30 non-null object
Purchase Price      30 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 3.5+ KB

In [148]:
df_z[df_z['Job']=='Lawyer'].count()

Address             30
Lot                 30
AM or PM            30
Browser Info        30
Company             30
Credit Card         30
CC Exp Date         30
CC Security Code    30
CC Provider         30
Email               30
Job                 30
IP Address          30
Language            30
Purchase Price      30
dtype: int64

In [135]:
df_z[df_z['Job']=='Lawyer'].info()# probably the best solution

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 470 to 9979
Data columns (total 14 columns):
Address             30 non-null object
Lot                 30 non-null object
AM or PM            30 non-null object
Browser Info        30 non-null object
Company             30 non-null object
Credit Card         30 non-null int64
CC Exp Date         30 non-null object
CC Security Code    30 non-null int64
CC Provider         30 non-null object
Email               30 non-null object
Job                 30 non-null object
IP Address          30 non-null object
Language            30 non-null object
Purchase Price      30 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 3.5+ KB

#### ** How many people made the purchase during the AM and how many people made the purchase during PM ? **

In [66]:
df_z['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

### ** What are the 5 most common Job Titles? **

In [73]:
df_z['Job'].value_counts().head(5)

Interior and spatial designer        31
Lawyer                               30
Social researcher                    28
Research officer, political party    27
Designer, jewellery                  27
Name: Job, dtype: int64

#### ** Someone made a purchase that came from Lot: "90 WT" , what was the Purchase Price for this transaction? **

In [77]:
df_z[df_z['Lot']=="90 WT"]['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

#### ** What is the email of the person with the following Credit Card Number: 4926535242672853 **

In [83]:
df_z[df_z['Credit Card']== 4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

#### * How many people have American Express as their Credit Card Provider *and made a purchase above $95 ?**

###  syntax:            df_z[()  &   ()]

In [137]:
df_z[(df_z['CC Provider']=='American Express') & (df_z['Purchase Price']>95)].count()

Address             39
Lot                 39
AM or PM            39
Browser Info        39
Company             39
Credit Card         39
CC Exp Date         39
CC Security Code    39
CC Provider         39
Email               39
Job                 39
IP Address          39
Language            39
Purchase Price      39
dtype: int64

#### ** Hard: How many people have a credit card that expires in 2025? **

In [151]:
df_z['CC Exp Date'].iloc[0] # returns a string

'02/20'

In [152]:
df_z['CC Exp Date'].iloc[0][3]# index 3 and beyond

'2'

In [144]:
sum(df_z['CC Exp Date'].apply(lambda x: x[3:]) == '25') # do not understand

1033

Another way of solving this problem is

In [153]:
df_z[df_z['CC Exp Date'].apply(lambda x: x[3:]) == '25'].count() # do not understand

Address             1033
Lot                 1033
AM or PM            1033
Browser Info        1033
Company             1033
Credit Card         1033
CC Exp Date         1033
CC Security Code    1033
CC Provider         1033
Email               1033
Job                 1033
IP Address          1033
Language            1033
Purchase Price      1033
dtype: int64

#### ** Hard: What are the top 5 most popular email providers/hosts (e.g. gmail.com, yahoo.com, etc...) **

Detail process for this problem

In [159]:
es_email = df_z['Email'].iloc[0]
es_email

'pdunlap@yahoo.com'

In [160]:
es_email.split('@')

['pdunlap', 'yahoo.com']

In [161]:
es_email.split('@')[1]

'yahoo.com'

In [146]:
df_z['Email'].apply(lambda x: x.split('@')[1]).value_counts().head(5)

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64

# Great Job!Â¶